Repository: StanfordSpezi/SpeziFirebase
Catalog: Sources/SpeziFirestore/Resources/Localizable.xcstrings
Source language: en
Languages: de

# FIRESTORE_ERROR_ABORTED
source: The operation was aborted, typically due to a concurrency issue like transaction aborts, etc.
de: Der Vorgang wurde abgebrochen, typischerweise aufgrund eines Nebenläufigkeitsproblems wie Transaktionsabbrüchen usw.

# FIRESTORE_ERROR_ALREADYEXISTS
source: Some document that we attempted to create already exists.
de: Ein Dokument, das wir erstellen wollten, existiert bereits.

# FIRESTORE_ERROR_CANCELLED
source: The operation was cancelled (typically by the caller).
de: Der Vorgang wurde abgebrochen (typischerweise vom Aufrufer).

# FIRESTORE_ERROR_DATALOSS
source: Unrecoverable data loss or corruption.
de: Unwiederbringlicher Datenverlust oder Beschädigung.

# FIRESTORE_ERROR_DEADLINEEXCEEDED
source: Deadline expired before operation could complete. For operations that change the state of the system, this error may be returned even if the operation has completed successfully. For example, a successful response from a server could have been delayed long enough for the deadline to expire.
de: Die Frist ist abgelaufen, bevor der Vorgang abgeschlossen werden konnte. Bei Vorgängen, die den Systemzustand ändern, kann dieser Fehler zurückgegeben werden, auch wenn der Vorgang erfolgreich abgeschlossen wurde. Zum Beispiel könnte eine erfolgreiche Antwort von einem Server so lange verzögert worden sein, dass die Frist abgelaufen ist.

# FIRESTORE_ERROR_DECODINGFIELDCONFLICT %@
source: Field conflict during the decoding: %@
de: Feldkonflikt während der Dekodierung: %@

# FIRESTORE_ERROR_DECODINGNOTSUPPORTED %@
source: Decoding is not supported: %@
de: Dekodierung wird nicht unterstützt: %@

# FIRESTORE_ERROR_ENCODINGNOTSUPPORTED %@
source: Encoding is not supported: %@
de: Kodierung wird nicht unterstützt: %@

# FIRESTORE_ERROR_FAILEDPRECONDITION
source: Operation was rejected because the system is not in a state required for the operation's execution.
de: Der Vorgang wurde abgelehnt, weil das System nicht im für die Ausführung des Vorgangs erforderlichen Zustand ist.

# FIRESTORE_ERROR_INTERNAL
source: Internal errors. Means some invariants expected by underlying system has been broken. If you see one of these errors, something is very broken.
de: Interne Fehler. Das bedeutet, dass einige von dem zugrunde liegenden System erwartete Invarianten verletzt wurden. Wenn Sie einen dieser Fehler sehen, ist etwas sehr kaputt.

# FIRESTORE_ERROR_INVALIDARGUMENT
source: Client specified an invalid argument. Note that this differs from FailedPrecondition. InvalidArgument indicates arguments that are problematic regardless of the state of the system (e.g., an invalid field name).
de: Der Client hat ein ungültiges Argument angegeben. Beachten Sie, dass dies sich von FailedPrecondition unterscheidet. InvalidArgument weist auf Argumente hin, die unabhängig vom Systemzustand problematisch sind (z. B. ein ungültiger Feldname).

# FIRESTORE_ERROR_NOTFOUND
source: Some requested document was not found.
de: Ein angefordertes Dokument wurde nicht gefunden.

# FIRESTORE_ERROR_OUTOFRANGE
source: Operation was attempted past the valid range.
de: Der Vorgang wurde außerhalb des gültigen Bereichs versucht.

# FIRESTORE_ERROR_PERMISSIONDENIED
source: The caller does not have permission to execute the specified operation.
de: Der Anrufer hat keine Berechtigung, den angegebenen Vorgang auszuführen.

# FIRESTORE_ERROR_RESOURCEEXHAUSTED
source: Some resource has been exhausted, perhaps a per-user quota, or perhaps the entire file system is out of space.
de: Eine Ressource ist erschöpft, vielleicht ein Benutzerkontingent oder vielleicht ist das gesamte Dateisystem voll.

# FIRESTORE_ERROR_UNAUTHENTICATED
source: The request does not have valid authentication credentials for the operation.
de: Die Anfrage verfügt nicht über gültige Authentifizierungsdaten für den Vorgang.

# FIRESTORE_ERROR_UNAVAILABLE
source: The service is currently unavailable. This is a most likely a transient condition and may be corrected by retrying with a backoff.
de: Der Dienst ist derzeit nicht verfügbar. Dies ist höchstwahrscheinlich ein vorübergehender Zustand und kann durch erneutes Versuchen mit einer Verzögerung korrigiert werden.

# FIRESTORE_ERROR_UNIMPLEMENTED
source: Operation is not implemented or not supported/enabled.
de: Der Vorgang ist nicht implementiert oder nicht aktiviert/unterstützt.

# FIRESTORE_ERROR_UNKNOWN
source: Unknown error or an error from a different error domain.
de: Unbekannter Fehler oder ein Fehler aus einem anderen Fehlerdomäne.
